Autodesk.Revit.DB.FreeFormElement.UpdateSolidGeometry(Autodesk.Revit.DB.Solid)
Updates the geometry of the FreeForm element to the given shape preserving References to the existing geometry where possible (see remarks for rules).
Remarks:
Rules for preserving References:
First preserve faces as Reference when exclusively coincident with existing faces.Then preserve faces as Reference if exclusively parallel to existing faces.Then preserve faces as Reference if exclusive at small angle to the existing faces.Any other faces are will not be preserved as a Reference.
Edges are preserved as References if and only if exclusively bound to faces that are also preserved as References.
newGeometry:
The new geometry to set in the FreeForm element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.FreeFormElement.CanOffsetFace(Autodesk.Revit.DB.Face)
Determines if the input face of the FreeFormElement can be offset.
face:
The face to be checked.
Returns:
True if the face can be offset, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.FreeFormElement.SetFaceOffset(Autodesk.Revit.DB.Face,System.Double)
Offsets a planar face of the free form element a certain distance in the normal direction.
face:
The face to offset.
offset:
The magnitude of the offset. A positive value offsets out of the input solid. A negative value offsets into the solid shape.
Throws Autodesk.Revit.Exceptions.ArgumentException:
face does not belong to the solid.
-or-
The face to be offset should be planar and satisfy constraints of its parent element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.FreeFormElement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Solid)
Creates a new FreeFormElement from a copy of the input geometry.
document:
The document in which the element is to be created.
geometry:
The input geometry.
Returns:
returns a new FreeFormElement
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a family document, nor a document editing an in-place family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.FreeFormElement
A Free Form Element that contains non-parametric geometry created from an input solid outline.
Remarks:
The element can participate in joins and void cuts with other combinable elements.
Since:
2014